MikroElektronika/core_packages/ARM/gcc_clang/system/src/sam/atsamrh71/thirdparty/atsamrh71/component/icm.h
/* -------- ICM_UIHVAL3 : (ICM Offset: 0x44) ( /W 32) User Initial Hash Value 0 Register 3 -------- */
#define ICM_UIHVAL3_VAL_Pos                   _U_(0)                                               /**< (ICM_UIHVAL3) Initial Hash Value Position */
#define ICM_UIHVAL3_VAL_Msk                   (_U_(0xFFFFFFFF) << ICM_UIHVAL3_VAL_Pos)             /**< (ICM_UIHVAL3) Initial Hash Value Mask */
#define ICM_UIHVAL3_VAL(value)                (ICM_UIHVAL3_VAL_Msk & ((value) << ICM_UIHVAL3_VAL_Pos))
#define ICM_UIHVAL3_Msk                       _U_(0xFFFFFFFF)                                      /**< (ICM_UIHVAL3) Register Mask  */


/* -------- ICM_UIHVAL4 : (ICM Offset: 0x48) ( /W 32) User Initial Hash Value 0 Register 4 -------- */
#define ICM_UIHVAL4_VAL_Pos                   _U_(0)                                               /**< (ICM_UIHVAL4) Initial Hash Value Position */
#define ICM_UIHVAL4_VAL_Msk                   (_U_(0xFFFFFFFF) << ICM_UIHVAL4_VAL_Pos)             /**< (ICM_UIHVAL4) Initial Hash Value Mask */
#define ICM_UIHVAL4_VAL(value)                (ICM_UIHVAL4_VAL_Msk & ((value) << ICM_UIHVAL4_VAL_Pos))
#define ICM_UIHVAL4_Msk                       _U_(0xFFFFFFFF)                                      /**< (ICM_UIHVAL4) Register Mask  */


/* -------- ICM_UIHVAL5 : (ICM Offset: 0x4C) ( /W 32) User Initial Hash Value 0 Register 5 -------- */
#define ICM_UIHVAL5_VAL_Pos                   _U_(0)                                               /**< (ICM_UIHVAL5) Initial Hash Value Position */
#define ICM_UIHVAL5_VAL_Msk                   (_U_(0xFFFFFFFF) << ICM_UIHVAL5_VAL_Pos)             /**< (ICM_UIHVAL5) Initial Hash Value Mask */
#define ICM_UIHVAL5_VAL(value)                (ICM_UIHVAL5_VAL_Msk & ((value) << ICM_UIHVAL5_VAL_Pos))
#define ICM_UIHVAL5_Msk                       _U_(0xFFFFFFFF)                                      /**< (ICM_UIHVAL5) Register Mask  */


/* -------- ICM_UIHVAL6 : (ICM Offset: 0x50) ( /W 32) User Initial Hash Value 0 Register 6 -------- */
#define ICM_UIHVAL6_VAL_Pos                   _U_(0)                                               /**< (ICM_UIHVAL6) Initial Hash Value Position */
#define ICM_UIHVAL6_VAL_Msk                   (_U_(0xFFFFFFFF) << ICM_UIHVAL6_VAL_Pos)             /**< (ICM_UIHVAL6) Initial Hash Value Mask */
#define ICM_UIHVAL6_VAL(value)                (ICM_UIHVAL6_VAL_Msk & ((value) << ICM_UIHVAL6_VAL_Pos))
#define ICM_UIHVAL6_Msk                       _U_(0xFFFFFFFF)                                      /**< (ICM_UIHVAL6) Register Mask  */


/* -------- ICM_UIHVAL7 : (ICM Offset: 0x54) ( /W 32) User Initial Hash Value 0 Register 7 -------- */
#define ICM_UIHVAL7_VAL_Pos                   _U_(0)                                               /**< (ICM_UIHVAL7) Initial Hash Value Position */
#define ICM_UIHVAL7_VAL_Msk                   (_U_(0xFFFFFFFF) << ICM_UIHVAL7_VAL_Pos)             /**< (ICM_UIHVAL7) Initial Hash Value Mask */
#define ICM_UIHVAL7_VAL(value)                (ICM_UIHVAL7_VAL_Msk & ((value) << ICM_UIHVAL7_VAL_Pos))
#define ICM_UIHVAL7_Msk                       _U_(0xFFFFFFFF)                                      /**< (ICM_UIHVAL7) Register Mask  */


/* -------- ICM_WPMR : (ICM Offset: 0xE4) (R/W 32) ICM Write Protection Mode Register -------- */
#define ICM_WPMR_WPEN_Pos                     _U_(0)                                               /**< (ICM_WPMR) Write Protection Enable Position */
#define ICM_WPMR_WPEN_Msk                     (_U_(0x1) << ICM_WPMR_WPEN_Pos)                      /**< (ICM_WPMR) Write Protection Enable Mask */
#define ICM_WPMR_WPEN(value)                  (ICM_WPMR_WPEN_Msk & ((value) << ICM_WPMR_WPEN_Pos))
#define ICM_WPMR_WPITEN_Pos                   _U_(1)                                               /**< (ICM_WPMR) Write Protection Interrupt Enable Position */
#define ICM_WPMR_WPITEN_Msk                   (_U_(0x1) << ICM_WPMR_WPITEN_Pos)                    /**< (ICM_WPMR) Write Protection Interrupt Enable Mask */
#define ICM_WPMR_WPITEN(value)                (ICM_WPMR_WPITEN_Msk & ((value) << ICM_WPMR_WPITEN_Pos))
#define ICM_WPMR_WPCREN_Pos                   _U_(2)                                               /**< (ICM_WPMR) Write Protection Control Enable Position */
#define ICM_WPMR_WPCREN_Msk                   (_U_(0x1) << ICM_WPMR_WPCREN_Pos)                    /**< (ICM_WPMR) Write Protection Control Enable Mask */
#define ICM_WPMR_WPCREN(value)                (ICM_WPMR_WPCREN_Msk & ((value) << ICM_WPMR_WPCREN_Pos))
#define ICM_WPMR_WPKEY_Pos                    _U_(8)                                               /**< (ICM_WPMR) Write Protection Key Position */
#define ICM_WPMR_WPKEY_Msk                    (_U_(0xFFFFFF) << ICM_WPMR_WPKEY_Pos)                /**< (ICM_WPMR) Write Protection Key Mask */
#define ICM_WPMR_WPKEY(value)                 (ICM_WPMR_WPKEY_Msk & ((value) << ICM_WPMR_WPKEY_Pos))
#define   ICM_WPMR_WPKEY_PASSWD_Val           _U_(0x49434D)                                        /**< (ICM_WPMR) Writing any other value in this field aborts the write operation of the WPEN, WPITEN and WPCREN bits.Always reads as 0  */
#define ICM_WPMR_WPKEY_PASSWD                 (ICM_WPMR_WPKEY_PASSWD_Val << ICM_WPMR_WPKEY_Pos)    /**< (ICM_WPMR) Writing any other value in this field aborts the write operation of the WPEN, WPITEN and WPCREN bits.Always reads as 0 Position  */
#define ICM_WPMR_Msk                          _U_(0xFFFFFF07)                                      /**< (ICM_WPMR) Register Mask  */


/* -------- ICM_WPSR : (ICM Offset: 0xE8) ( R/ 32) ICM Write Protection Status Register -------- */
#define ICM_WPSR_WPVS_Pos                     _U_(0)                                               /**< (ICM_WPSR) Write Protection Violation Status (Cleared on read) Position */
#define ICM_WPSR_WPVS_Msk                     (_U_(0x1) << ICM_WPSR_WPVS_Pos)                      /**< (ICM_WPSR) Write Protection Violation Status (Cleared on read) Mask */
#define ICM_WPSR_WPVS(value)                  (ICM_WPSR_WPVS_Msk & ((value) << ICM_WPSR_WPVS_Pos))
#define ICM_WPSR_WPVSRC_Pos                   _U_(8)                                               /**< (ICM_WPSR) Write Protection Violation Source Position */
#define ICM_WPSR_WPVSRC_Msk                   (_U_(0xFF) << ICM_WPSR_WPVSRC_Pos)                   /**< (ICM_WPSR) Write Protection Violation Source Mask */
#define ICM_WPSR_WPVSRC(value)                (ICM_WPSR_WPVSRC_Msk & ((value) << ICM_WPSR_WPVSRC_Pos))
#define ICM_WPSR_Msk                          _U_(0x0000FF01)                                      /**< (ICM_WPSR) Register Mask  */


/** \brief ICM register offsets definitions */
#define ICM_RADDR_REG_OFST             (0x00)              /**< (ICM_RADDR) Region Start Address Offset */
#define ICM_RCFG_REG_OFST              (0x04)              /**< (ICM_RCFG) Region Configuration Offset */
#define ICM_RCTRL_REG_OFST             (0x08)              /**< (ICM_RCTRL) Region Control Offset */
#define ICM_RNEXT_REG_OFST             (0x0C)              /**< (ICM_RNEXT) Region Next Address Offset */
#define ICM_CFG_REG_OFST               (0x00)              /**< (ICM_CFG) Configuration Register Offset */
#define ICM_CTRL_REG_OFST              (0x04)              /**< (ICM_CTRL) Control Register Offset */
#define ICM_SR_REG_OFST                (0x08)              /**< (ICM_SR) Status Register Offset */
#define ICM_IER_REG_OFST               (0x10)              /**< (ICM_IER) Interrupt Enable Register Offset */
#define ICM_IDR_REG_OFST               (0x14)              /**< (ICM_IDR) Interrupt Disable Register Offset */
#define ICM_IMR_REG_OFST               (0x18)              /**< (ICM_IMR) Interrupt Mask Register Offset */
#define ICM_ISR_REG_OFST               (0x1C)              /**< (ICM_ISR) Interrupt Status Register Offset */
#define ICM_UASR_REG_OFST              (0x20)              /**< (ICM_UASR) Undefined Access Status Register Offset */
#define ICM_DSCR_REG_OFST              (0x30)              /**< (ICM_DSCR) Region Descriptor Area Start Address Register Offset */
#define ICM_HASH_REG_OFST              (0x34)              /**< (ICM_HASH) Region Hash Area Start Address Register Offset */
#define ICM_UIHVAL0_REG_OFST           (0x38)              /**< (ICM_UIHVAL0) User Initial Hash Value 0 Register 0 Offset */
#define ICM_UIHVAL1_REG_OFST           (0x3C)              /**< (ICM_UIHVAL1) User Initial Hash Value 0 Register 1 Offset */
#define ICM_UIHVAL2_REG_OFST           (0x40)              /**< (ICM_UIHVAL2) User Initial Hash Value 0 Register 2 Offset */
#define ICM_UIHVAL3_REG_OFST           (0x44)              /**< (ICM_UIHVAL3) User Initial Hash Value 0 Register 3 Offset */
#define ICM_UIHVAL4_REG_OFST           (0x48)              /**< (ICM_UIHVAL4) User Initial Hash Value 0 Register 4 Offset */
#define ICM_UIHVAL5_REG_OFST           (0x4C)              /**< (ICM_UIHVAL5) User Initial Hash Value 0 Register 5 Offset */
#define ICM_UIHVAL6_REG_OFST           (0x50)              /**< (ICM_UIHVAL6) User Initial Hash Value 0 Register 6 Offset */
#define ICM_UIHVAL7_REG_OFST           (0x54)              /**< (ICM_UIHVAL7) User Initial Hash Value 0 Register 7 Offset */
#define ICM_WPMR_REG_OFST              (0xE4)              /**< (ICM_WPMR) ICM Write Protection Mode Register Offset */
#define ICM_WPSR_REG_OFST              (0xE8)              /**< (ICM_WPSR) ICM Write Protection Status Register Offset */

